create_clock -name {clk_48MHz} -period 20.8333333333333 -waveform {0 10} [get_nets clk_48MHz]
create_clock -name {clk_Virtual_12MHz} -period 83.3333333333333 -waveform {0 40}
set_input_delay -clock [get_clocks clk_48MHz] -max -add_delay 3 [get_ports {iRAM_ADQ[7] iRAM_ADQ[6] iRAM_ADQ[5] iRAM_ADQ[4] iRAM_ADQ[3] iRAM_ADQ[2] iRAM_ADQ[1] iRAM_ADQ[0] iRAM_CE iRAM_CLK iRAM_DQS_DM iRAM_RST }]
set_input_delay -clock [get_clocks clk_48MHz] -min -add_delay 1 [get_ports {iRAM_ADQ[7] iRAM_ADQ[6] iRAM_ADQ[5] iRAM_ADQ[4] iRAM_ADQ[3] iRAM_ADQ[2] iRAM_ADQ[1] iRAM_ADQ[0] iRAM_CE iRAM_CLK iRAM_DQS_DM iRAM_RST }]
set_input_delay -clock [get_clocks clk_48MHz] -clock_fall -max -add_delay 3 [get_ports {iRAM_ADQ[7] iRAM_ADQ[6] iRAM_ADQ[5] iRAM_ADQ[4] iRAM_ADQ[3] iRAM_ADQ[2] iRAM_ADQ[1] iRAM_ADQ[0] iRAM_CE iRAM_CLK iRAM_RST iRAM_DQS_DM}]
set_input_delay -clock [get_clocks clk_48MHz] -clock_fall -min -add_delay 1 [get_ports {iRAM_CE iRAM_ADQ[7] iRAM_ADQ[6] iRAM_ADQ[5] iRAM_ADQ[4] iRAM_ADQ[3] iRAM_ADQ[2] iRAM_ADQ[1] iRAM_ADQ[0] iRAM_CLK iRAM_RST iRAM_DQS_DM}]
set_output_delay -clock [get_clocks clk_48MHz] -max -add_delay 3 [get_ports {ioPSRAM_ADQ[7] ioPSRAM_ADQ[6] ioPSRAM_ADQ[5] ioPSRAM_ADQ[4] ioPSRAM_ADQ[3] ioPSRAM_ADQ[2] ioPSRAM_ADQ[1] ioPSRAM_ADQ[0]}]
set_output_delay -clock [get_clocks clk_48MHz] -min -add_delay 1 [get_ports {ioPSRAM_ADQ[7] ioPSRAM_ADQ[6] ioPSRAM_ADQ[5] ioPSRAM_ADQ[4] ioPSRAM_ADQ[3] ioPSRAM_ADQ[2] ioPSRAM_ADQ[1] ioPSRAM_ADQ[0]}]
set_output_delay -clock [get_clocks clk_48MHz] -clock_fall -max -add_delay 3 [get_ports {ioPSRAM_ADQ[7] ioPSRAM_ADQ[6] ioPSRAM_ADQ[5] ioPSRAM_ADQ[4] ioPSRAM_ADQ[3] ioPSRAM_ADQ[2] ioPSRAM_ADQ[1] ioPSRAM_ADQ[0]}]
set_output_delay -clock [get_clocks clk_48MHz] -clock_fall -min -add_delay 1 [get_ports {ioPSRAM_ADQ[7] ioPSRAM_ADQ[6] ioPSRAM_ADQ[5] ioPSRAM_ADQ[4] ioPSRAM_ADQ[3] ioPSRAM_ADQ[2] ioPSRAM_ADQ[1] ioPSRAM_ADQ[0]}]
set_input_delay -clock [get_clocks clk_48MHz] -max -add_delay 3 [get_ports ioPSRAM_DQS_DM]
set_input_delay -clock [get_clocks clk_48MHz] -min -add_delay 1 [get_ports ioPSRAM_DQS_DM]
set_output_delay -clock [get_clocks clk_48MHz] -max -add_delay 3 [get_ports oPSRAM_CE]
set_output_delay -clock [get_clocks clk_48MHz] -min -add_delay 1 [get_ports oPSRAM_CE]
set_output_delay -clock [get_clocks clk_48MHz] -max 3 [get_ports oPSRAM_CLK]
set_output_delay -clock [get_clocks clk_48MHz] -min 1 [get_ports oPSRAM_CLK]
set_input_delay -clock [get_clocks clk_48MHz] -max 3 [get_ports iSample_Done]
set_input_delay -clock [get_clocks clk_48MHz] -min 1 [get_ports iSample_Done]
